package com.sg.alma55.utilities

import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import com.sg.alma55.databinding.ActivityHelpExplanationBinding
import com.sg.alma55.utilities.Constants.HELP_EXPLANATION_INDEX

class HelpExplanationActivity : AppCompatActivity() {
    private lateinit var binding: ActivityHelpExplanationBinding
    private var expalationIndex = 0

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        binding = ActivityHelpExplanationBinding.inflate(layoutInflater)
        setContentView(binding.root)
        expalationIndex = intent.getIntExtra(HELP_EXPLANATION_INDEX, 0)
        when (expalationIndex) {
            1 -> getText1()
            2 -> getText2()
            3 -> getText3()
            4 -> getText4()
            5 -> getText5()
            6 -> getText6()
            7 -> getText7()
            71 -> getText71()
            8 -> getText8()
            9 -> getText9()
            10 -> getText10()

            else -> "אין הסבר לסעיף הזה"
        }
    }

    private fun getText1() {
        val st = "הגעת למסך עזרה להסבר כללי על האפליקציה" + "\n" +
         "-------------------------" + "\n" +
        "האפליקציה הזאת כוללת חלק מהפוסטים שכתבתי בשנים האחרונות," + "\n" +
                "למה אני כותב פוסטים ?" + "\n" +
                "כי זו הדרך היחידה לבדוק אם אני עדיין חי" + "\n" +
                "למה אתם צריכים לקרא את כל זה ?" + "\n" +
                "זהו, שאתם ממש לא צריכים לקרא דבר , חופשיים ללכת למקרר או לטלווזיה." + "\n" +
                " ------------------------- " + "\n" +
                " אם אתם לא מבינים לפעמים מה נכתב, אתם בחברה טובה... " + "\n" +
                " גם אני לא תמיד מבין ואני כתבתי את כל זה ." + "\n" +
                " קחו את הזמן, תקראו לאט ותנו למילים להכנס ," + "\n" +
                " אם אתם מוצאים את עצמכם בין המילים האלה , זה הכל." + "\n" +
                "וממש ממש לא משנה  מה אני התכוונתי במילים האלו" + "\n" +
                " ------------------------- " + "\n" +
                "באפליקציה הזו" + "\n" +
                "יש פוסטים מלפני עשר שנים ויש כאן פוסטים מלפני עשר דקות." + "\n" +
                "הכל מעורבב, אין סיפור אין התפתחות בעלילה כל פוסט בפני עצמו," + "\n" +
                "כמו הרגעים בחיים שהם אומנם קורים לך " + "\n" +
                "אבל כל רגע עומד בפני עצמו." + "\n" +
                " ------------------------- " + "\n" +
                "האפליקציה יושבת על הענן כך שכל מה שאני מפרסם מופיע מיד בזמן אמיתי אצלך במכשיר." + "\n" +
                "כן , כמו הפיסבוק והאינסטרגם  רק שפחות יציב ויותר שלי. " + "\n" +
                "כל הפוסטים בנושאי מודעות מתוך ההסתכלות הסוביקטיבית שלי על החיים. " + "\n" +
                "זה פחות מאמת גדולה ויותר תובנות קטנות זמניות ומקומיות על חיים של מישהו . " + "\n" +
                " אז אם אתם מחפשים משחק מעניין לעבור מסכים ולצבור נקודות  " + "\n" +
                " זה לא המקום שלכם . " + "\n" +
                " אם התחושה שלכם כמו שלי שהעולם הזה לפעמים קטן מידי ומחניק,  " + "\n" +
                " אז יש סיכוי מה שתמצאו משהו כאן שידבר אליכם . " + "\n" +
                " ------------------------- " + "\n" +
                " כמו שאני רואה עכשיו האפליקציה הזאת כרגע היא בשלבים ההתחלתיים שלה " + "\n" +
                " כמובן יש בה המון בעיות ואשמח (לא הכי) לכל הערה," + "\n" +
                " ממה שנראה היא תלבש ותפשוט צורות בצורה עקבית,  " + "\n" +
                " אני מניח שכל כמה שבועות יצא עדכון אז אל תתיאשו אם משהו לא זורם שם..." + "\n" +
                ""
        binding.tvExplenation.text = st
    }

    private fun getText2() {
        val st = "הגעת למסך עזרה בנושא איך מתחילים לעבוד עם האפליקציה" + "\n" +
         "------------------------------" + "\n" +
                     "אז איך מתחילים ?" + "\n" +
                "איזה התרגשות, איזה התרגשות... הזדמנות אחרונה לברוח מההאפליקציה הזאת ..." + "\n" +
                " ------------------------- " + "\n" +
                "פשוט החלק את האצבע בעדינות על התמונה משמאל לימין והנה הגעת לפוסט הבא," + "\n" +
                "נכון לא מסובך , נכון לא מסובך ..." + "\n" +
                "אם הקלקת על התמונה במקום להחליק עליה -> תגיע למסך אחר שמאוחר יותר נעסוק בו," + "\n" +
                "ואם כבר הגעת למסך הזה, לחץ על הלחצן (לחצן החזור)  <  כדי לחזור לתמונה האורגינלית.  " + "\n" +
                "במידה והחלקת חזק מידי מספר פוסטים ירוצו עד שהאפלקציה תעצר על תמונה כלשהיא," + "\n" +
                "המיומנות שצריך לפתח זו היכולת להחליק בעדינות כך שרק פוסט אחד יעבור" + "\n" +
                "(טיפ:בלחיצה שלך על המסך תן וקטור חזק יותר ורטיקלי (יחסי)  ועדין יותר לצד)" + "\n" +
                "בכל מקרה" + "\n" +
                "זה יכול להיות משחק יפה להחליק כמה תמונות במכה למי שאוהב משחקי החלקה." + "\n" +
                "כאמור במידה ותקליק על התמונה תגיע ל*מסך ההערות*," + "\n" +
                "לכל פוסט יש מסך הערות משלו" + "\n" +
                "שם אתה יכול לכתוב את ההשגות שלך על הפוסט על עצמך על כל העולם הזה ואחותו הצולעת ...  " + "\n" +
                "ואפילו לפתח דיון על הפוסט עם שאר המשתתפים, " + "\n" +
                "רק אם יש לך באמת כוח לזה (ואין לך). " + "\n" +
                "ראה פירוט נוסף ב:" + "\n" +
                " --הגדרות--" + "\n" +
                "-- עזרה --" + "\n" +
                "-- מסך הערות של הפוסט --" + "\n" +
                " ------------------------- " + "\n" +
                "לא הבנתי מה זה : " + "\n" +
                "--מסך ההערות של הפוסט--" + "\n" +
                "ובכן בכל פעם שאתם רואים שני קוים קטנים מצד ימין של המילה או הביטוי ושני קוים קטנים מצד שמאל" + "\n" +
                "הסתכלו על המסך וחפשו את המילה או הביטוי והקליקו עליה. " + "\n" +
                "לדוגמה " + "\n" +
                "הקלקתם על התמונה והגעתם למסך הערות , יופי אתם ממש מוכשרים. " + "\n" +
                "והנה מפיע בהוראות כאן משהו כמו :      -- הגדרות -- " + "\n" +
                "חפשו במסך כפתור שעליו כתוב: הגדרות , מצאתם , יופי לחצו עליו ... " + "\n" +
                "הגעתם למסך ההגדרות,  " + "\n" +
                "עכשיו מופיע עוד בהוראות :  --עזרה-- " + "\n" +
                "הסתכלו במסך וחפשו כפתור שכתוב עליו : עזרה , לחצו עליו, " + "\n" +
                "עכשיו מופיע עוד בהוראות :  --מסך הערות של הפוסט-- " + "\n" +
                "הסתכלו במסך וחפשו כפתור שכתוב עליו : מסך הערות של הפוסט  , לחצו עליו " + "\n" +
                "הגעתם ליעד אתם עשר , לכו לנוח שבוע לפחות.  " + "\n" +
                " ------------------------- " + "\n" +
                "לפעמים יופיעו לכם הערות בתחתית המסך שבאות להסביר לכם כשיש בעיה כלשהיא, " + "\n" +
                "אז אל תקחו את זה אישית ותעלבו, וההודעות האלה יעלמו אחרי כמה שניות ..." + "\n" +
                ""
        binding.tvExplenation.text = st
    }

    private fun getText3() {
        val st = "הגעת למסך עזרה בנושא סדר הופעת הפוסטים " + "\n" +
         "------------------------------" + "\n" +
        "ישנם שלוש צורות של הצגת הפוסטים :" + "\n" +
                "הצגה לפי זמן הפרסום (רקע תכלת)" + "\n" +
                "הצגה לפי המומלצים (רקע ירוק)" + "\n" +
                "הצגה לפי העדפות אישיות(רקע צהוב)" + "\n" +
                "את רקע אנחנו רואים במעבר בין התמונות " + "\n" +
                "------------------------" + "\n" +
                "הבה נתחיל בהצגה לפי זמן הפרסום :" + "\n" +
                "אם פרסמתי פוסט א' לפני חמש דקות ופוסט ב' לפני עשר דקות" + "\n" +
                "   אז פוסט א' יופיע לפני פוסט ב',  " + "\n" +
                " כלומר זמן פירסום הפוסט קובע את מיקומו .  " + "\n" +
                " הפוסטים החדשים (מבחינת זמן הפרסום שלהם) יופיעו ראשונים.  " + "\n" +
                "כללית זמן הפרסום של הפוסט אינו שלב היצירה שלו" + "\n" +
                "כלומר אני יכול לפרסם פוסט שנכתב לפני שנים" + "\n" +
                "ואחריו לפרסם פוסט שנכתב לפני דקה." + "\n" +
                "והם יופיעו אחד אחרי השני." + "\n" +
                "כללית" + "\n" +
                "האפליקציה נעזרת בענן כך שברגע שפוסט מפורסם " + "\n" +
                "זה מופיע אצלכם מיד במכשיר." + "\n" +
                "איזה כיף." + "\n" +
                "האפליקציה תתחיל תמיד במצב הזה, של סידור לפי זמן הפרסום " + "\n" +
                "בשלב הבא תוכל לשנות את הסדר לפי רצונך. " + "\n" +
                "------------------------" + "\n" +
                " הצורה השניה של הצגת הפוסטים היא:" + "\n" +
                " הצגה לפי המומלצים:" + "\n" +
                "מי הממליץ ? אני." + "\n" +
                "למה ואיך ? סתם ." + "\n" +
                "הפוסטים המומלצים יותר יופיעו ראשונים." + "\n" +
                "זה פחות או יותר רשימה ראשונית שתעודכן לפי הרצונות של המשתמשים" + "\n" +
                "אל דאגה , איך לבחור פוסטים איפה מתי ולמה , כל זה בהמשך. " + "\n" +
                "------------------------" + "\n" +
                " הצורה השלישית של הצגת הפוסטים היא:" + "\n" +
                " הצגה לפי העדפות האישיות:" + "\n" +
                "כן כן ,אתה יכול לעשות רשימת העדפות משלך ," + "\n" +
                "ראה את הלחצן הבא בתפריט:" + "\n" +
                " --דירוג פוסט אישי--." + "\n" +
                "כך שאם תפתח את האפליקציה ותרצה לראות את הפוסטים בסדר מסוים" + "\n" +
                "אז זה המקום." + "\n" +
                "אם תנסה לעבור לאופציה הזאת ועדיין לא הכנסת אף פוסט מועדף תקבל הודעת הזהרה בצד התחתון של המסך" + "\n" +
                "שאומרת לך שקודם תכניס מועדפים וחר כך תראה את הרשימה שלך." + "\n" +
                "בשבל מה זה טוב ?" + "\n" +
                "יש מאות פוסטים ולא תמיד יש לך חשק לעבור עליהם אחד לאחד," + "\n" +
                "בא לך לעבור רק על הפוסטים המדורגים שלך תחילה " + "\n" +
                "אז הנה יש לך את האפשרות הזו." + "\n"
        "אם דרגת רק פוסט אחד , אז הרשימה שלך תכלול רק אותו, כלומר רשימה של אבר אחד. " + "\n"
        ""
        binding.tvExplenation.text = st
    }

    private fun getText4() {
        val st = "הגעת למסך עזרה בנושא דירוג אישי של הפוסט " + "\n" +
         "-------------------------------" + "\n" +
         "לכל פוסט אתה יכול להיכנס ולתת דרוג אישי מאפס עד מאה," + "\n" +
                "אפס  -> לפוסט פח שממש לא עשה לך את זה " + "\n" +
                "ומאה -> לפוסט אש שממש התחברת אליו." + "\n" +
                "איך נותנים ציון לפוסט ?" + "\n" +
                "ובכן, הגעת לפוסט מסוים שאתה רוצה לדרג אותו" + "\n" +
                "הקלק על התמונה של הפוסט " + "\n" +
                " --הגדרות--" + "\n" +
                " --דרג את הפוסט הזה--" + "\n" +
                " הכנס את הדירוג שלך " + "\n" +
                " --לחץ כדי להמשיך--." + "\n" +
                " אפשר לשנות את הדירוג האישי הזה בכל שלב ." + "\n"+
        " הדירוג האישי הזה נשמר אצלך במחשב כך שאיש לא יודע אותו." + "\n"+
        " כללית" + "\n" +
                "פוסטים עם הדירוג הגבוה יופיעו ראשונים " + "\n" +
                "לדוגמה פוסט שקיבל 88 יופיע לפני פוסט שקיבל 87, " + "\n" +
                "לפיכך רצוי שתחשוב על הדירוג שאתה נותן לכל פוסט. " + "\n" +
                "פוסט שלא דורג על ידך לא יופיע כלל ברשימה של הדירוג האישי (למרות שהוא נמצא ברשימה הכללית של הסידור לפי זמן פירסום). " + "\n" +
                ""
        binding.tvExplenation.text = st
    }

    private fun getText5() {
        val st = "אז איך משנים את צורת הופעת הפוסטים בפועל ?" + "\n" +
                "------------------------" + "\n" +
                "הצגת פוסטים לפי זמן הפרסום:" + "\n" +
                "------------------------" + "\n" +
                "הקלק על תמונה כלשהי" + "\n" +
                " --הגדרות--" + "\n" +
                "--סדר את הפוסטים לפי תאריך הפרסום--" + "\n" +
                "והנה הגעת להצגה הזו " + "\n" +
                "שם לב שבהחלפת התמונות הרקע הוא תכלת" + "\n" +
                "------------------------" + "\n" +
                "הצגת פוסטים לפי המומלצים:" + "\n" +
                "------------------------" + "\n" +
                "הקלק על תמונה כלשהי" + "\n" +
                " --הגדרות--" + "\n" +
                "--סדר את הפוסטים לפי המומלצים--" + "\n" +
                "והנה הגעת להצגה הזו " + "\n" +
                "שם לב שבהחלפת התמונות הרקע הוא ירוק" + "\n" +
                "------------------------" + "\n" +
                "הצגת פוסטים לפי דרוג אישי:" + "\n" +
                "------------------------" + "\n" +
                "הקלק על תמונה כלשהי" + "\n" +
                " --הגדרות--" + "\n" +
                "--סדר את הפוסטים לפי הדרוגים שלך--" + "\n" +
                "(במידה ועדיין לא דרגת אף פוסט, התוכנה תבקש ממך קודם לדרג מינימום פוסט אחד.)" + "\n" +
                "והנה הגעת להצגה הזו. " + "\n" +
                "שם לב שבהחלפת התמונות הרקע הוא צהוב" + "\n" +
                ""
        binding.tvExplenation.text = st
    }


    private fun getText6() {
        val st = "הגעת למסך עזרה לגבי צורת עבודה מומלצת:  " + "\n" +
         "---------------------------" + "\n" +
                "תתחיל תמיד עם סידור פוסטים לפי זמן פירסום כדי לראות מה חדש," + "\n" +
                "(התוכנה מתחילה כברירת מחדל עם צורת הסידור הזאת)" + "\n" +
                "במידה ונתקלת בפוסט שעשה לך את זה, דרג אותו." + "\n" +
                "עבור למומלצים  " + "\n" +
                "במידה ונתקלת בפוסט שעשה לך את זה, דרג אותו." + "\n" +
                "אחרי שגמרת לחרוש מה חדש ומה מומלץ עבור לראות את הפוסטים לפי הדירוג  האישי שלך." + "\n"+
                ""
        binding.tvExplenation.text = st
    }

    private fun getText7() {
        val st = "הגעת למסך עזרה ל*מסך ההערות*" + "\n" +
         "----------------------" + "\n" +
               "כדי להגיע ל+מסך ההערות+ פשוט הקלק על התמונה בפוסט " + "\n" +
                "והנה הגעת למסך ההערות , נכון זה לא היה קשה ..." + "\n" +
                "בחלק העליון של המסך שלשה כפתורים :" + "\n" +
                "הכפתור הימני עליון:  --הכנס--   כדי להיכנס לחשבון האישי שלך, " + "\n" +
                "הכפתור האמצעי עליון:  נותן את שם המשתמש שלך," + "\n" +
                "הכפתור השמאלי עליון :  --הגדרות--  מעביר אותך למסך ההגדרות. " + "\n" +
                "הכפתור השמאלי תחתון :  --עזרה--  מעביר אותך למסך העזרה. " + "\n" +
                "הכפתור ימני תחתון :  נותן את מצב התמונה של הפוסט " + "\n" +
                "מצב ראשון דינמי --> התמונה זזה באנימציה " + "\n" +
                "מצב שני סטטי --> התמונה עומדת " + "\n" +
                "מתחת לשורת הכפתורים העליונה  באמצע" + "\n" +
                " מופיע מספר הפוסט ואחר כך פירוט הפוסט. " + "\n" +
                "בתחתית המסך יש מקום בתוך התחום הירוק לכתוב את הערה שלך" + "\n" +
                "וחץ מצד שמאל -->  כדי לשלוח את הערה לענן, והיא תופיע אצלך ואצל כל המשתמשים בזמן אמיתי." + "\n" +
                "----------------------" + "\n" +
                "במידה ותלחץ על מספר הפוסט " + "\n" +
                "יש הפתעה " + "\n" +
                "אתה מועבר למסך אחר בו אתה יכול לעבור לכל פוסט לפי המספר שלו... " + "\n" +
                "למה זה טוב אתה שואל " + "\n" +
                "קח סיטואציה  שגלשת אתמול באפליקציה (ששעמם לך) ונתקלת בפוסט מעניין שמספרו 4322" + "\n" +
                "והנה היום אתה רוצה לחזור אליו כדי להכניס אותו לרשימת העדפות שלך" + "\n" +
                "אז הנה אפשרות לעשות את זה" + "\n" +
                "אגב הערה לגבי מיספור הפוסטים, המספר הראשון תמיד מראה את מספר השורות בפוסט" + "\n" +
                "למשל בפוסט 4322 מספר השורות הוא 4" + "\n" +
                "----------------------" + "\n" +
                "על מה כותבים הערות ?" + "\n" +
                "על צורה: תמונה , פונט, צבעים, העמדה... " + "\n" +
                "על מהות: מה אני מרגיש וחושב על מה שנכתב בפוסט ועל מה שאחרים כתבו," + "\n" +
                "אישית הייתי רוצה לדעת איפה המילים האלה פגשו אותכם. " + "\n" +
                "נקודה חשובה " + "\n" +
                "רק מי שנרשם (ראה בסעיף הבא --רישום--) יכול לכתוב הערות, " + "\n" +
                "וההגיון מאחורי זה : אם אין לך שם משתמש אי אפשר להתייחס למה שאתה כותב." + "\n" +
                "כדי לערוך הערה שכתבת או לבטל אותה , לחץ על איזור הערה ותועבר למסך שמאפשר זאת." + "\n" +
                ""
        binding.tvExplenation.text = st
    }

    private fun getText71() {
        val st = "הגעת למסך עזרה  להערות-  כללי" + "\n" +
                "---------------------------" + "\n" +
                "המסך הזה כשמו כן הוא" + "\n" +
                "לכתיבת הערות כלליות על האפליקציה " + "\n" +
                "צורה תיפעול תוכן וכו' ..." + "\n" +
                "במדה ותרצה שפוסט מסוים יופיע בסידור לפי המומלצים במיקום גבוה יותר " + "\n" +
                "זה המקום להמליץ עליו. " + "\n" +
                ""
        binding.tvExplenation.text = st
    }

    private fun getText8() {
        val st = " הגעת למסך העזרה ברישום, " + "\n" +
                "----------------------------" + "\n" +
                " ועל ההתחלה נבהיר אין ברישום שום פגיעה בפרטיות שלך... " + "\n" +
                " אתה יכול להכניס שם משתמש וכתובת מייל פקטיבית כך שאיש (כולל אני) לא יזהו אותך.  " + "\n" +
                " אם נרשמת ונכנסת למכשיר שלך בפעם הבאה האפליקציה תכניס אותך מידית. " + "\n" +
                " במידה ואתה רשום כבר במסך הערות בכפתור האמצעי יופיע שם המשתמש שלך," + "\n" +
                " במידה שלא יופיע שם : --אורח--." + "\n" +
                "ובמידה ואתה בחזקת אורח ואתה רוצה להרשם ...." + "\n" +
                "הקלד על  --הכנס--" + "\n" +
                "-- אם אין לך חשבון לחץ כאן --" + "\n" +
                "מלא את כל מה שנדרש" + "\n" +
                "--לחץ כדי לבצע רישום --" + "\n" +
                "הרישום הזה הוא  שלב ראשון של הרישום." + "\n" +
                "הוא לכשעצמו מספיק אבל ממולץ לבצע גם את השלב השני של הרישום." + "\n" +
                "--------------------------------" + "\n" +
                "השלב השני של הרישום :" + "\n" +
                "(שהוא חופף לשינוי הפרופיל)" + "\n" +
                "הקלד על תמונה כלשהיא" + "\n" +
                "--הגדרות--" + "\n" +
                "--שנה פרופיל--" + "\n" +
                "הכנס תמונה מזהה משלך על ידי הקלקה על התמונה הקיימת" + "\n" +
                "הכנס זכר / נקבה" + "\n" +
                "--לחץ כדי לשמור שינויים בפרופיל--" + "\n" +
                ""
        binding.tvExplenation.text = st
    }

    private fun getText9() {
        val st = " הגעת למסך עזרה לשינוי פרופיל " + "\n" +
                "---------------------" + "\n" +
                "כמו תמיד לחץ על איזשהיא תמונה" + "\n" +
                "--הגדרות--" + "\n" +
                "  --שנה פרופיל--" + "\n" +
                "נכנסת לפרופיל הקיים שלך כרגע " + "\n" +
                "לחץ על התמונה בראש העמוד ועדכן אותה למשהו משלך" + "\n" +
                "עדכן את שאר הפרטים " + "\n" +
                "הכנס זכר / נקבה" + "\n" +
                "-- שמור שינויים בפרופיל--" + "\n" +
                ""
        binding.tvExplenation.text = st
    }

    private fun getText10() {
        val st = " הגעת למסך עזרה של ההגדרות " + "\n" +
        " ------------------- " + "\n" +
        " אז ראשית איך מגיעים למסך ההגדרות  " + "\n" +
        " לחץ על תמונה כלשהיא " + "\n" +
                " --הגדרות-- " + "\n" +
                " ------------------- " + "\n" +
                "הגעת למסך ההגדרות הבה נעבור על המסך סעיף סעיף" + "\n" +
                " ------------------- " + "\n" +
                "דרג את הפוסט הזה --> תן את הדירוג האישי שלך לפוסט שאתה נמצא עליו כרגע." + "\n" +
                " ------------------- " + "\n" +
                "סדר את הפוסטים לפי הדירוגים שלך--> דובר על זה,  זה מובן." + "\n" +
                " ------------------- " + "\n" +
                ".סדר את הפוסטים לפי תאריך פרסום  --> דובר על זה,  זה מובן." + "\n" +
                " ------------------- " + "\n" +
                "שנה פרופיל -->   ראה סעיף קודם בהגדרות של שנוי פרופיל." + "\n" +
                " ------------------- " + "\n" +
                "עבור לפוסט אחר --> מעבר לפוסט אחר מהמקום שאתה נמצא כרגע." + "\n" +
                " ------------------- " + "\n" +
                "מסך הערות --> מעביר אותך למסך עם כל ההערות באפליקציה לפי תאריך הכתיבה שלהם." + "\n" +
                " אם כתבת הערה כלשהיא ואתה רוצה לדעת אם יש התייחסות," + "\n" +
                " אתר את הערה לפי התאריך שהיא נכתבה," + "\n" +
                " לחץ על ההערה ואתה תועבר לפוסט המדובר." + "\n" +
                " ------------------- " + "\n" +
                "מסך פתיחה --> אפשרות לקבוע אחרי כמה זמן המסך פתיחה יעלם, במידה ותכניס אפס שניות המסך פתיחה לא יופיע ותגיע ישר לפוסטים. " + "\n" +
                " ------------------- " + "\n" +
                "מצב אורח --> אפשרות לגלוש שלא בשם שלך , אלא כאורח (וזה אומר שלא תוכל לכתוב הערות). " + "\n" +
                " ------------------- " + "\n" +
                "הזזת תמונת רקע --> ישנם שני אפשריות של תמונת רקע " + "\n" +
                "אפשרות ראשונה: תמונה סטטית " + "\n" +
                "אפשרות שנייה : תמונה שזזה באנימציה " + "\n" +
                "כל לחיצה על הכפתור תתן את האופציה השניה לאופציה הקיימת" + "\n" +
                " ------------------- " + "\n" +
                "עזרה --> מפתיע אבל זה מעביר אותך למסך הכללי של העזרה. " + "\n" +
                ""
        binding.tvExplenation.text = st
    }
}
